de_A/webservices/movinu/UpdateWosWorkAssignment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:mov="http://schemas.datacontract.org/2004/07/MovinU.Data.Erp.Ax">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:UpdateWosWorkAssignment>
         <!--Optional:-->
         <tem:workAssignment>
            <!--Optional:-->
            <mov:Assignment>
               <!--Optional:-->
               <mov:ConstructorInstruction>?</mov:ConstructorInstruction>
               <!--Optional:-->
               <mov:WorkOrderList>
                  <!--Zero or more repetitions:-->
                  <mov:WorkOrder>
                     <!--Optional:-->
                     <mov:AXInspectionActivityID>?</mov:AXInspectionActivityID>
                     <!--Optional:-->
                     <mov:AXInspectionComment>?</mov:AXInspectionComment>
                     <!--Optional:-->
                     <mov:AXInspectionNumber>?</mov:AXInspectionNumber>
                     <!--Optional:-->
                     <mov:AXInspectionObservationID>?</mov:AXInspectionObservationID>
                     <!--Optional:-->
                     <mov:AXInspectionUnitID>?</mov:AXInspectionUnitID>
                     <!--Optional:-->
                     <mov:WOStoAXInspectionID>?</mov:WOStoAXInspectionID>
                     <!--Optional:-->
                     <mov:WorkOrderAccountable>?</mov:WorkOrderAccountable>
                     <!--Optional:-->
                     <mov:WorkOrderAmount>?</mov:WorkOrderAmount>
                     <!--Optional:-->
                     <mov:WorkOrderDate>?</mov:WorkOrderDate>
                     <!--Optional:-->
                     <mov:WorkOrderID>?</mov:WorkOrderID>
                     <!--Optional:-->
                     <mov:WorkOrderPayer>?</mov:WorkOrderPayer>
                  </mov:WorkOrder>
               </mov:WorkOrderList>
               <!--Optional:-->
               <mov:assignmentID>?</mov:assignmentID>
               <!--Optional:-->
               <mov:assignmentStatus>?</mov:assignmentStatus>
               <!--Optional:-->
               <mov:constructorName>?</mov:constructorName>
            </mov:Assignment>
            <!--Optional:-->
            <mov:IntakeID>?</mov:IntakeID>
            <!--Optional:-->
            <mov:company>?</mov:company>
            <!--Optional:-->
            <mov:objectId>?</mov:objectId>
         </tem:workAssignment>
      </tem:UpdateWosWorkAssignment>
   </soapenv:Body>
</soapenv:Envelope>